## Plan Result (688: zr_sbox_acr - TerraformPlanApply)




<pre><code>Plan: 2 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_role_assignment.zr_acr[&#34;hmctssbox-cft-aks-sbox-mi-pull&#34;]
  * azurerm_role_assignment.zr_acr[&#34;hmctssbox-sds-aks-sbox-mi-pull&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_role_assignment.zr_acr["hmctssbox-cft-aks-sbox-mi-pull"] will be created
  + resource "azurerm_role_assignment" "zr_acr" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "96775d73-e4f3-49ee-8bb6-f8660a19ba85"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "AcrPull"
      + scope                            = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/cnp-acr-rg/providers/Microsoft.ContainerRegistry/registries/hmctssbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.zr_acr["hmctssbox-sds-aks-sbox-mi-pull"] will be created
  + resource "azurerm_role_assignment" "zr_acr" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "09d99cb4-e1e7-49c2-a8e6-b5b1740e9c3b"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "AcrPull"
      + scope                            = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/cnp-acr-rg/providers/Microsoft.ContainerRegistry/registries/hmctssbox"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>





## :warning: Errors

* failed to add a label 688: zr_sbox_acr - TerraformPlanApply/add-or-update: label name is too long (max: 50)
<!-- github-comment: {"Command":"plan","PRNumber":32,"Program":"tfcmt","SHA1":"","Target":"688: zr_sbox_acr - TerraformPlanApply","Vars":{}} -->